#mod_test_20250414_1.py
# 특정 배수의 합을 구한다. 

#1 ~ 10 까지 더하기

##################################################

i = 0
num = 0
while i <= 10:
    num = i + num
    i = i + 1
print("결과 1 : ", num)

##################################################
#2의 배수만 출력

i = 0
num = 0
while i <= 10:
    i = i + 1
    if i%2 == 0:
        num = i + num
        print("결과 2 : %5s -> 합 %5s" %(i,num))

##################################################
#2 또는 3의 배수만 출력

i = 0
num = 0
while i <= 10:
    i = i + 1
    if i%2 == 0 or i%3 == 0:
        num = i + num
        print("결과 3 : %5s -> 합 %5s" %(i,num))
